{"keras_version": "1.2.2", "class_name": "Model", "config": {"layers": [{"config": {"batch_input_shape": [null, 50176], "input_dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"activation": "relu", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": {"l1": 0.0010000000474974513, "name": "L1L2Regularizer", "l2": 0.0}, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 50176, "output_dim": 128, "name": "dense_1", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_1"}, {"config": {"activation": "relu", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 128, "output_dim": 64, "name": "dense_2", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}, {"config": {"activation": "relu", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 64, "output_dim": 32, "name": "dense_3", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3"}, {"config": {"activation": "relu", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 32, "output_dim": 64, "name": "dense_4", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4"}, {"config": {"activation": "relu", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 64, "output_dim": 128, "name": "dense_5", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dense_5"}, {"config": {"activation": "sigmoid", "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "input_dim": 128, "output_dim": 50176, "name": "dense_6", "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0]]], "name": "dense_6"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_6", 0, 0]]}}