{"keras_version": "1.2.2", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 50176], "name": "input_1", "input_dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 32, "bias": true, "activation": "relu", "activity_regularizer": {"l1": 9.999999747378752e-05, "l2": 0.0, "name": "L1L2Regularizer"}, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "W_regularizer": null, "input_dim": 50176, "W_constraint": null}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 50176, "bias": true, "activation": "sigmoid", "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "W_regularizer": null, "input_dim": 32, "W_constraint": null}, "name": "dense_2"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}