{"keras_version": "1.2.2", "config": {"name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 50176], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"input_dim": 50176, "b_regularizer": null, "trainable": true, "W_regularizer": null, "name": "dense_1", "activation": "relu", "activity_regularizer": {"l2": 0.0, "l1": 9.999999747378752e-05, "name": "L1L2Regularizer"}, "bias": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 32, "W_constraint": null}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Dense"}, {"config": {"input_dim": 32, "b_regularizer": null, "trainable": true, "W_regularizer": null, "name": "dense_2", "activation": "sigmoid", "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "output_dim": 50176, "W_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model"}