{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 50176], "sparse": false}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "output_dim": 32, "activity_regularizer": {"name": "L1L2Regularizer", "l2": 0.0, "l1": 9.999999747378752e-05}, "init": "glorot_uniform", "b_constraint": null, "input_dim": 50176, "bias": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "sigmoid", "output_dim": 50176, "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": 32, "bias": true}, "inbound_nodes": [[["dense_1", 0, 0]]]}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.2"}