{"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50176], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": {"l1": 9.999999747378752e-05, "l2": 0.0, "name": "L1L2Regularizer"}, "W_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true, "name": "dense_1", "input_dim": 50176, "b_regularizer": null, "b_constraint": null, "output_dim": 32}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "W_constraint": null, "bias": true, "name": "dense_2", "input_dim": 32, "b_regularizer": null, "b_constraint": null, "output_dim": 50176}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]]}]}, "class_name": "Model", "keras_version": "1.2.2"}