{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 50176], "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "input_dim": 50176, "activity_regularizer": {"name": "L1L2Regularizer", "l1": 9.999999747378752e-05, "l2": 0.0}, "activation": "relu", "init": "glorot_uniform", "trainable": true, "output_dim": 32, "b_regularizer": null, "name": "dense_1"}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"W_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "input_dim": 32, "activity_regularizer": null, "activation": "sigmoid", "init": "glorot_uniform", "trainable": true, "output_dim": 50176, "b_regularizer": null, "name": "dense_2"}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]]}]}, "class_name": "Model", "keras_version": "1.2.2"}